rocksdb/experiments/M2/results/20260429-055153-budget-sensitivity/baseline_budget_off/budget_off/run_1/db_bench.log
RocksDB:    version 8.11.3
Date:       Wed Apr 29 05:51:55 2026
CPU:        16 * Intel(R) Xeon(R) Gold 5320 CPU @ 2.20GHz
CPUCache:   16384 KB
Set seed to 1777441915101179 because --seed was 0
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
Keys:       16 bytes each (+ 0 bytes user-defined timestamp)
Values:     1024 bytes each (512 bytes after compression)
Entries:    5000000
Prefix:    0 bytes
Keys per prefix:    0
RawSize:    4959.1 MB (estimated)
FileSize:   2517.7 MB (estimated)
Write rate: 0 bytes/second
Read rate: 0 ops/second
Compression: NoCompression
Compression sampling rate: 0
Memtablerep: SkipListFactory
Perf Level: 1
------------------------------------------------
Initializing RocksDB Options from the specified file
Initializing RocksDB Options from command-line flags
Integrated BlobDB: blob cache disabled
DB path: [rocksdbtest/dbbench]
fillrandom   :       6.703 micros/op 149183 ops/sec 33.516 seconds 5000000 operations;  148.0 MB/s
DB path: [rocksdbtest/dbbench]
overwrite    :      10.787 micros/op 92700 ops/sec 53.937 seconds 5000000 operations;   91.9 MB/s
DB path: [rocksdbtest/dbbench]
overwrite    :       9.125 micros/op 109591 ops/sec 45.624 seconds 5000000 operations;  108.7 MB/s


** Compaction Stats [default] **
Level    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop Rblob(GB) Wblob(GB)
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
  L0     10/0   622.80 MB   2.5      0.0     0.0      0.0      14.5     14.5       0.0   1.0      0.0    434.2     34.28             26.13       239    0.143       0      0       0.0       0.0
  L1     18/1    1.16 GB   4.4     26.5    13.9     12.6      23.5     10.9       0.0   1.7    350.5    310.4     77.51             60.85        20    3.875     26M  3087K       0.0       0.0
  L2     91/2    4.52 GB   1.8     21.9     9.2     12.7      16.7      4.0       0.6   1.8    439.0    334.3     51.01             39.05       139    0.367     22M  5304K       0.0       0.0
 Sum    119/3    6.29 GB   0.0     48.4    23.1     25.3      54.7     29.4       0.6   3.8    304.4    344.0    162.79            126.03       398    0.409     49M  8391K       0.0       0.0
 Int      0/0    0.00 KB   0.0     48.4    23.1     25.3      54.4     29.1       0.6   3.8    305.6    343.7    162.19            125.58       394    0.412     49M  8391K       0.0       0.0

** Compaction Stats [default] **
Priority    Files   Size     Score Read(GB)  Rn(GB) Rnp1(GB) Write(GB) Wnew(GB) Moved(GB) W-Amp Rd(MB/s) Wr(MB/s) Comp(sec) CompMergeCPU(sec) Comp(cnt) Avg(sec) KeyIn KeyDrop Rblob(GB) Wblob(GB)
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
 Low      0/0    0.00 KB   0.0     48.4    23.1     25.3      40.1     14.9       0.0   0.0    385.6    319.9    128.51             99.90       159    0.808     49M  8391K       0.0       0.0
High      0/0    0.00 KB   0.0      0.0     0.0      0.0      14.5     14.5       0.0   0.0      0.0    434.2     34.28             26.13       239    0.143       0      0       0.0       0.0

Blob file count: 0, total size: 0.0 GB, garbage size: 0.0 GB, space amp: 0.0

Uptime(secs): 133.1 total, 130.1 interval
Flush(GB): cumulative 14.537, interval 14.293
AddFile(GB): cumulative 0.000, interval 0.000
AddFile(Total Files): cumulative 0, interval 0
AddFile(L0 Files): cumulative 0, interval 0
AddFile(Keys): cumulative 0, interval 0
Cumulative compaction: 54.69 GB write, 420.76 MB/s write, 48.40 GB read, 372.37 MB/s read, 162.8 seconds
Interval compaction: 54.44 GB write, 428.58 MB/s write, 48.40 GB read, 380.98 MB/s read, 162.2 seconds
Write Stall (count): cf-l0-file-count-limit-delays-with-ongoing-compaction: 18, cf-l0-file-count-limit-stops-with-ongoing-compaction: 0, l0-file-count-limit-delays: 18, l0-file-count-limit-stops: 0, memtable-limit-delays: 0, memtable-limit-stops: 0, pending-compaction-bytes-delays: 0, pending-compaction-bytes-stops: 0, total-delays: 18, total-stops: 0
interval: 18 total count
Block cache LRUCache@0x55b77ec40df0#84130 capacity: 32.00 MB seed: 1911906299 usage: 0.09 KB table_size: 1024 occupancy: 1 collections: 1 last_copies: 1 last_secs: 0.000168 secs_since: 133
Block cache entry stats(count,size,portion): Misc(1,0.00 KB,0%)

** File Read Latency Histogram By Level [default] **

** DB Stats **
Uptime(secs): 133.1 total, 130.1 interval
Cumulative writes: 15M writes, 15M keys, 15M commit groups, 1.0 writes per commit group, ingest: 14.75 GB, 113.50 MB/s
Cumulative WAL: 15M writes, 0 syncs, 15000000.00 writes per sync, written: 14.75 GB, 113.50 MB/s
Cumulative stall: 00:00:39.704 H:M:S, 29.8 percent
Interval writes: 14M writes, 14M keys, 14M commit groups, 1.0 writes per commit group, ingest: 14791.85 MB, 113.71 MB/s
Interval WAL: 14M writes, 0 syncs, 14687860.00 writes per sync, written: 14.45 GB, 113.71 MB/s
Interval stall: 00:00:39.704 H:M:S, 30.5 percent
Write Stall (count): write-buffer-manager-limit-stops: 0